[{"reference": "Quantum internet Networking challenges in distributed quantum computing", "title": "Quantum Internet: Networking Challenges in Distributed Quantum Computing", "abstract": "The Quantum Internet is envisioned as the final stage of the quantum\nrevolution, opening fundamentally new communications and computing\ncapabilities, including the distributed quantum computing. But the Quantum\nInternet is governed by the laws of quantum mechanics. Phenomena with no\ncounterpart in classical networks, such as no-cloning, quantum measurement,\nentanglement and teleporting, impose very challenging constraints for the\nnetwork design. Specifically, classical network functionalities, ranging from\nerror-control mechanisms to overhead-control strategies, are based on the\nassumption that classical information can be safely read and copied. But this\nassumption does not hold in the Quantum Internet. As a consequence, the design\nof the Quantum Internet requires a major network-paradigm shift to harness the\nquantum mechanics specificities. The goal of this work is to shed light on the\nchallenges and the open problems of the Quantum Internet design. To this aim,\nwe first introduce some basic knowledge of quantum mechanics, needed to\nunderstand the differences between a classical and a quantum network. Then, we\nintroduce quantum teleportation as the key strategy for transmitting quantum\ninformation without physically transferring the particle that stores the\nquantum information or violating the principles of the quantum mechanics.\nFinally, the key research challenges to design quantum communication networks\nare described.", "url": "http://arxiv.org/abs/1810.08421v2"}, {"reference": "Satellite-based entanglement distribution over 1200 kilometers", "title": "Satellite-Based Entanglement Distribution Over 1200 kilometers", "abstract": "Long-distance entanglement distribution is essential both for foundational\ntests of quantum physics and scalable quantum networks. Owing to channel loss,\nhowever, the previously achieved distance was limited to ~100 km. Here, we\ndemonstrate satellite-based distribution of entangled photon pairs to two\nlocations separated by 1203 km on the Earth, through satellite-to-ground\ntwo-downlink with a sum of length varies from 1600 km to 2400 km. We observe a\nsurvival of two-photon entanglement and a violation of Bell inequality by\n2.37+/-0.09 under strict Einstein locality conditions. The obtained effective\nlink efficiency at 1200 km in this work is over 12 orders of magnitude higher\nthan the direct bidirectional transmission of the two photons through the best\ncommercial telecommunication fibers with a loss of 0.16 dB/km.", "url": "http://arxiv.org/abs/1707.01339v1"}, {"reference": "Towards a distributed quantum computing ecosystem", "title": "Towards a Distributed Quantum Computing Ecosystem", "abstract": "The Quantum Internet, by enabling quantum communications among remote quantum\nnodes, is a network capable of supporting functionalities with no direct\ncounterpart in the classical world. Indeed, with the network and communications\nfunctionalities provided by the Quantum Internet, remote quantum devices can\ncommunicate and cooperate for solving challenging computational tasks by\nadopting a distributed computing approach. The aim of this paper is to provide\nthe reader with an overview about the main challenges and open problems arising\nwith the design of a Distributed Quantum Computing ecosystem. For this, we\nprovide a survey, following a bottom-up approach, from a communications\nengineering perspective. We start by introducing the Quantum Internet as the\nfundamental underlying infrastructure of the Distributed Quantum Computing\necosystem. Then we go further, by elaborating on a high-level system\nabstraction of the Distributed Quantum Computing ecosystem. Such an abstraction\nis described through a set of logical layers. Thereby, we clarify dependencies\namong the aforementioned layers and, at the same time, a road-map emerges.", "url": "http://arxiv.org/abs/2002.11808v2"}, {"reference": "Compiler design for distributed quantum computing", "title": "Compiler Design for Distributed Quantum Computing", "abstract": "In distributed quantum computing architectures, with the network and\ncommunications functionalities provided by the Quantum Internet, remote quantum\nprocessing units (QPUs) can communicate and cooperate for executing\ncomputational tasks that single NISQ devices cannot handle by themselves. To\nthis aim, distributed quantum computing requires a new generation of quantum\ncompilers, for mapping any quantum algorithm to any distributed quantum\ncomputing architecture. With this perspective, in this paper, we first discuss\nthe main challenges arising with compiler design for distributed quantum\ncomputing. Then, we analytically derive an upper bound of the overhead induced\nby quantum compilation for distributed quantum computing. The derived bound\naccounts for the overhead induced by the underlying computing architecture as\nwell as the additional overhead induced by the sub-optimal quantum compiler --\nexpressly designed through the paper to achieve three key features, namely,\ngeneral-purpose, efficient and effective. Finally, we validate the analytical\nresults and we confirm the validity of the compiler design through an extensive\nperformance analysis.", "url": "http://arxiv.org/abs/2012.09680v1"}, {"reference": "Quantum algorithms and simulation for parallel and distributed quantum computing", "title": "Quantum Algorithms and Simulation for Parallel and Distributed Quantum Computing", "abstract": "A viable approach for building large-scale quantum computers is to interlink\nsmall-scale quantum computers with a quantum network to create a larger\ndistributed quantum computer. When designing quantum algorithms for such a\ndistributed quantum computer, one can make use of the added parallelization and\ndistribution abilities inherent in the system. An added difficulty to then\novercome for distributed quantum computing is that a complex control system to\norchestrate the various components is required. In this work, we aim to address\nthese issues. We explicitly define what it means for a quantum algorithm to be\ndistributed and then present various quantum algorithms that fit the\ndefinition. We discuss potential benefits and propose a high-level scheme for\ncontrolling the system. With this, we present our software framework called\nInterlin-q, a simulation platform that aims to simplify designing and verifying\nparallel and distributed quantum algorithms. We demonstrate Interlin-q by\nimplementing some of the discussed algorithms using Interlin-q and layout\nfuture steps for developing Interlin-q into a control system for distributed\nquantum computers.", "url": "http://arxiv.org/abs/2106.06841v3"}, {"reference": "Deterministic multi-qubit entanglement in a quantum network", "title": "Deterministic multi-qubit entanglement in a quantum network", "abstract": "Quantum entanglement is a key resource for quantum computation and quantum\ncommunication \\cite{Nielsen2010}. Scaling to large quantum communication or\ncomputation networks further requires the deterministic generation of\nmulti-qubit entanglement \\cite{Gottesman1999,Duan2001,Jiang2007}. The\ndeterministic entanglement of two remote qubits has recently been demonstrated\nwith microwave photons\n\\cite{Kurpiers2018,Axline2018,Campagne2018,Leung2019,Zhong2019}, optical\nphotons \\cite{Humphreys2018} and surface acoustic wave phonons\n\\cite{Bienfait2019}. However, the deterministic generation and transmission of\nmulti-qubit entanglement has not been demonstrated, primarily due to limited\nstate transfer fidelities. Here, we report a quantum network comprising two\nseparate superconducting quantum nodes connected by a 1 meter-long\nsuperconducting coaxial cable, where each node includes three interconnected\nqubits. By directly connecting the coaxial cable to one qubit in each node, we\ncan transfer quantum states between the nodes with a process fidelity of\n$0.911\\pm0.008$. Using the high-fidelity communication link, we can prepare a\nthree-qubit Greenberger-Horne-Zeilinger (GHZ) state\n\\cite{Greenberger1990,Neeley2010,Dicarlo2010} in one node and deterministically\ntransfer this state to the other node, with a transferred state fidelity of\n$0.656\\pm 0.014$. We further use this system to deterministically generate a\ntwo-node, six-qubit GHZ state, globally distributed within the network, with a\nstate fidelity of $0.722\\pm0.021$. The GHZ state fidelities are clearly above\nthe threshold of $1/2$ for genuine multipartite entanglement \\cite{Guhne2010},\nand show that this architecture can be used to coherently link together\nmultiple superconducting quantum processors, providing a modular approach for\nbuilding large-scale quantum computers \\cite{Monroe2014,Chou2018}.", "url": "http://arxiv.org/abs/2011.13108v1"}, {"reference": "Realization of a multinode quantum network of remote solid-state qubits", "title": "Realization of a multi-node quantum network of remote solid-state qubits", "abstract": "The distribution of entangled states across the nodes of a future quantum\ninternet will unlock fundamentally new technologies. Here we report on the\nexperimental realization of a three-node entanglement-based quantum network. We\ncombine remote quantum nodes based on diamond communication qubits into a\nscalable phase-stabilized architecture, supplemented with a robust memory qubit\nand local quantum logic. In addition, we achieve real-time communication and\nfeed-forward gate operations across the network. We capitalize on the novel\ncapabilities of this network to realize two canonical protocols without\npost-selection: the distribution of genuine multipartite entangled states\nacross the three nodes and entanglement swapping through an intermediary node.\nOur work establishes a key platform for exploring, testing and developing\nmulti-node quantum network protocols and a quantum network control stack.", "url": "http://arxiv.org/abs/2102.04471v1"}, {"reference": "Qubit teleportation between non-neighbouring nodes in a quantum network", "title": "Qubit teleportation between non-neighboring nodes in a quantum network", "abstract": "Future quantum internet applications will derive their power from the ability\nto share quantum information across the network. Quantum teleportation allows\nfor the reliable transfer of quantum information between distant nodes, even in\nthe presence of highly lossy network connections. While many experimental\ndemonstrations have been performed on different quantum network platforms,\nmoving beyond directly connected nodes has so far been hindered by the\ndemanding requirements on the pre-shared remote entanglement, joint qubit\nreadout and coherence times. Here we realize quantum teleportation between\nremote, non-neighboring nodes in a quantum network. The network employs three\noptically connected nodes based on solid-state spin qubits. The teleporter is\nprepared by establishing remote entanglement on the two links, followed by\nentanglement swapping on the middle node and storage in a memory qubit. We\ndemonstrate that once successful preparation of the teleporter is heralded,\narbitrary qubit states can be teleported with fidelity above the classical\nbound, even with unit efficiency. These results are enabled by key innovations\nin the qubit readout procedure, active memory qubit protection during\nentanglement generation and tailored heralding that reduces remote entanglement\ninfidelities. Our work demonstrates a prime building block for future quantum\nnetworks and opens the door to exploring teleportation-based multi-node\nprotocols and applications.", "url": "http://arxiv.org/abs/2110.11373v1"}, {"reference": "Quantum Computation and Quantum Information", "title": "Quantum Computation and Quantum Information", "abstract": "Quantum computation and quantum information are of great current interest in\ncomputer science, mathematics, physical sciences and engineering. They will\nlikely lead to a new wave of technological innovations in communication,\ncomputation and cryptography. As the theory of quantum physics is fundamentally\nstochastic, randomness and uncertainty are deeply rooted in quantum\ncomputation, quantum simulation and quantum information. Consequently quantum\nalgorithms are random in nature, and quantum simulation utilizes Monte Carlo\ntechniques extensively. Thus statistics can play an important role in quantum\ncomputation and quantum simulation, which in turn offer great potential to\nrevolutionize computational statistics. While only pseudo-random numbers can be\ngenerated by classical computers, quantum computers are able to produce genuine\nrandom numbers; quantum computers can exponentially or quadratically speed up\nmedian evaluation, Monte Carlo integration and Markov chain simulation. This\npaper gives a brief review on quantum computation, quantum simulation and\nquantum information. We introduce the basic concepts of quantum computation and\nquantum simulation and present quantum algorithms that are known to be much\nfaster than the available classic algorithms. We provide a statistical\nframework for the analysis of quantum algorithms and quantum simulation.", "url": "http://arxiv.org/abs/1210.0736v1"}, {"reference": "On the role of entanglement in quantum-computational speed-up", "title": "On the role of entanglement in quantum computational speed-up", "abstract": "For any quantum algorithm operating on pure states we prove that the presence\nof multi-partite entanglement, with a number of parties that increases\nunboundedly with input size, is necessary if the quantum algorithm is to offer\nan exponential speed-up over classical computation. Furthermore we prove that\nthe algorithm can be classically efficiently simulated to within a prescribed\ntolerance \\eta even if a suitably small amount of global entanglement\n(depending on \\eta) is present. We explicitly identify the occurrence of\nincreasing multi-partite entanglement in Shor's algorithm. Our results do not\napply to quantum algorithms operating on mixed states in general and we discuss\nthe suggestion that an exponential computational speed-up might be possible\nwith mixed states in the total absence of entanglement. Finally, despite the\nessential role of entanglement for pure state algorithms, we argue that it is\nnevertheless misleading to view entanglement as a key resource for quantum\ncomputational power.", "url": "http://arxiv.org/abs/quant-ph/0201143v2"}, {"reference": "Graph states for quantum secret sharing", "title": "Graph States for Quantum Secret Sharing", "abstract": "We consider three broad classes of quantum secret sharing with and without\neavesdropping and show how a graph state formalism unifies otherwise disparate\nquantum secret sharing models. In addition to the elegant unification provided\nby graph states, our approach provides a generalization of threshold classical\nsecret sharing via insecure quantum channels beyond the current requirement of\n100% collaboration by players to just a simple majority in the case of five\nplayers. Another innovation here is the introduction of embedded protocols\nwithin a larger graph state that serves as a one-way quantum information\nprocessing system.", "url": "http://arxiv.org/abs/0808.1532v3"}, {"reference": "Quantum algorithm implementations for beginners", "title": "Quantum Algorithm Implementations for Beginners", "abstract": "As quantum computers become available to the general public, the need has\narisen to train a cohort of quantum programmers, many of whom have been\ndeveloping classical computer programs for most of their careers. While\ncurrently available quantum computers have less than 100 qubits, quantum\ncomputing hardware is widely expected to grow in terms of qubit count, quality,\nand connectivity. This review aims to explain the principles of quantum\nprogramming, which are quite different from classical programming, with\nstraightforward algebra that makes understanding of the underlying fascinating\nquantum mechanical principles optional. We give an introduction to quantum\ncomputing algorithms and their implementation on real quantum hardware. We\nsurvey 20 different quantum algorithms, attempting to describe each in a\nsuccinct and self-contained fashion. We show how these algorithms can be\nimplemented on IBM's quantum computer, and in each case, we discuss the results\nof the implementation with respect to differences between the simulator and the\nactual hardware runs. This article introduces computer scientists, physicists,\nand engineers to quantum algorithms and provides a blueprint for their\nimplementations.", "url": "http://arxiv.org/abs/1804.03719v3"}, {"reference": "How deep the theory of quantum communications goes Superadditivity superactivation and causal activation", "title": "How Deep the Theory of Quantum Communications Goes: Superadditivity, Superactivation and Causal Activation", "abstract": "In the theory of quantum communications, a deeper structure has been recently\nunveiled, showing that the capacity does not completely characterize the\nchannel ability to transmit information due to phenomena -- namely,\nsuperadditivity, superactivation and causal activation -- with no counterpart\nin the classical world. Although how deep goes this structure is yet to be\nfully uncovered, it is crucial for the communication engineering community to\nown the implications of these phenomena for understanding and deriving the\nfundamental limits of communications. Hence, the aim of this treatise is to\nshed light on these phenomena by providing the reader with an easy access and\nguide towards the relevant literature and the prominent results from a\ncommunication engineering perspective.", "url": "http://arxiv.org/abs/2108.07108v3"}, {"reference": "Experimental comparison of two quantum computing architectures", "title": "Experimental Comparison of Two Quantum Computing Architectures", "abstract": "We run a selection of algorithms on two state-of-the-art 5-qubit quantum\ncomputers that are based on different technology platforms. One is a publicly\naccessible superconducting transmon device with limited connectivity, and the\nother is a fully connected trapped-ion system. Even though the two systems have\ndifferent native quantum interactions, both can be programmed in a way that is\nblind to the underlying hardware, thus allowing the first comparison of\nidentical quantum algorithms between different physical systems. We show that\nquantum algorithms and circuits that employ more connectivity clearly benefit\nfrom a better connected system of qubits. While the quantum systems here are\nnot yet large enough to eclipse classical computers, this experiment exposes\ncritical factors of scaling quantum computers, such as qubit connectivity and\ngate expressivity. In addition, the results suggest that co-designing\nparticular quantum applications with the hardware itself will be paramount in\nsuccessfully using quantum computers in the future.", "url": "http://arxiv.org/abs/1702.01852v1"}, {"reference": "Analysis of error propagation in quantum computers", "title": "Analysis of Error Propagation in Quantum Computers", "abstract": "Most quantum gate errors can be characterized by two error models, namely the\nprobabilistic error model and the Kraus error model. We proved that for a\nquantum circuit with either of those two models or a mix of both, the\npropagation error in terms of Frobenius norm is upper bounded by $2(1 - (1 -\nr)^m)$, where $0 \\le r < 1$ is a constant independent of the qubit number and\ncircuit depth, and $m$ is the number of gates in the circuit. Numerical\nexperiments of synthetic quantum circuits and quantum Fourier transform\ncircuits are performed on the simulator of the IBM Vigo quantum computer to\nverify our analytical results, which show that our upper bound is tight.", "url": "http://arxiv.org/abs/2209.01699v1"}, {"reference": "Challenges and opportunities of near-term quantum computing systems", "title": "Challenges and Opportunities of Near-Term Quantum Computing Systems", "abstract": "The concept of quantum computing has inspired a whole new generation of\nscientists, including physicists, engineers, and computer scientists, to\nfundamentally change the landscape of information technology. With experimental\ndemonstrations stretching back more than two decades, the quantum computing\ncommunity has achieved a major milestone over the past few years: the ability\nto build systems that are stretching the limits of what can be classically\nsimulated, and which enable cloud-based research for a wide range of\nscientists, thus increasing the pool of talent exploring early quantum systems.\nWhile such noisy near-term quantum computing systems fall far short of the\nrequirements for fault-tolerant systems, they provide unique testbeds for\nexploring the opportunities for quantum applications. Here we highlight the\nfacets associated with these systems, including quantum software, cloud access,\nbenchmarking quantum systems, error correction and mitigation in such systems,\nand understanding the complexity of quantum circuits and how early quantum\napplications can run on near term quantum computers.", "url": "http://arxiv.org/abs/1910.02894v1"}, {"reference": "Efficient and effective quantum compiling for entanglement-based machine learning on ibm q devices", "title": "Efficient and Effective Quantum Compiling for Entanglement-based Machine Learning on IBM Q Devices", "abstract": "Quantum compiling means fast, device-aware implementation of quantum\nalgorithms (i.e., quantum circuits, in the quantum circuit model of\ncomputation). In this paper, we present a strategy for compiling IBM Q -aware,\nlow-depth quantum circuits that generate Greenberger-Horne-Zeilinger (GHZ)\nentangled states. The resulting compiler can replace the QISKit compiler for\nthe specific purpose of obtaining improved GHZ circuits. It is well known that\nGHZ states have several practical applications, including quantum machine\nlearning. We illustrate our experience in implementing and querying a uniform\nquantum example oracle based on the GHZ circuit, for solving the classically\nhard problem of learning parity with noise.", "url": "http://arxiv.org/abs/1801.02363v3"}, {"reference": "Learning the quantum algorithm for state overlap", "title": "Learning the quantum algorithm for state overlap", "abstract": "Short-depth algorithms are crucial for reducing computational error on\nnear-term quantum computers, for which decoherence and gate infidelity remain\nimportant issues. Here we present a machine-learning approach for discovering\nsuch algorithms. We apply our method to a ubiquitous primitive: computing the\noverlap ${\\rm Tr}(\\rho\\sigma)$ between two quantum states $\\rho$ and $\\sigma$.\nThe standard algorithm for this task, known as the Swap Test, is used in many\napplications such as quantum support vector machines, and, when specialized to\n$\\rho = \\sigma$, quantifies the Renyi entanglement. Here, we find algorithms\nthat have shorter depths than the Swap Test, including one that has a constant\ndepth (independent of problem size). Furthermore, we apply our approach to the\nhardware-specific connectivity and gate sets used by Rigetti's and IBM's\nquantum computers and demonstrate that the shorter algorithms that we derive\nsignificantly reduce the error - compared to the Swap Test - on these\ncomputers.", "url": "http://arxiv.org/abs/1803.04114v2"}, {"reference": "An efficient methodology for mapping quantum circuits to the ibm qx architectures", "title": "An Efficient Methodology for Mapping Quantum Circuits to the IBM QX Architectures", "abstract": "In the past years, quantum computers more and more have evolved from an\nacademic idea to an upcoming reality. IBM's project IBM Q can be seen as\nevidence of this progress. Launched in March 2017 with the goal to provide\naccess to quantum computers for a broad audience, this allowed users to conduct\nquantum experiments on a 5-qubit and, since June 2017, also on a 16-qubit\nquantum computer (called IBM QX2 and IBM QX3, respectively). Revised versions\nof these 5-qubit and 16-qubit quantum computers (named IBM QX4 and IBM QX5,\nrespectively) are available since September 2017. In order to use these, the\ndesired quantum functionality (e.g. provided in terms of a quantum circuit) has\nto be properly mapped so that the underlying physical constraints are satisfied\n- a complex task. This demands solutions to automatically and efficiently\nconduct this mapping process. In this paper, we propose a methodology which\naddresses this problem, i.e. maps the given quantum functionality to a\nrealization which satisfies all constraints given by the architecture and, at\nthe same time, keeps the overhead in terms of additionally required quantum\ngates minimal. The proposed methodology is generic, can easily be configured\nfor similar future architectures, and is fully integrated into IBM's SDK.\nExperimental evaluations show that the proposed approach clearly outperforms\nIBM's own mapping solution. In fact, for many quantum circuits, the proposed\napproach determines a mapping to the IBM architecture within minutes, while\nIBM's solution suffers from long runtimes and runs into a timeout of 1 hour in\nseveral cases. As an additional benefit, the proposed approach yields mapped\ncircuits with smaller costs (i.e. fewer additional gates are required). All\nimplementations of the proposed methodology is publicly available at\nhttp://iic.jku.at/eda/research/ibm_qx_mapping.", "url": "http://arxiv.org/abs/1712.04722v3"}, {"reference": "Quantum algorithms An overview", "title": "Quantum algorithms: an overview", "abstract": "Quantum computers are designed to outperform standard computers by running\nquantum algorithms. Areas in which quantum algorithms can be applied include\ncryptography, search and optimisation, simulation of quantum systems, and\nsolving large systems of linear equations. Here we briefly survey some known\nquantum algorithms, with an emphasis on a broad overview of their applications\nrather than their technical details. We include a discussion of recent\ndevelopments and near-term applications of quantum algorithms.", "url": "http://arxiv.org/abs/1511.04206v2"}, {"reference": "A fast quantum mechanical algorithm for database search", "title": "A fast quantum mechanical algorithm for database search", "abstract": "Imagine a phone directory containing N names arranged in completely random\norder. In order to find someone's phone number with a 50% probability, any\nclassical algorithm (whether deterministic or probabilistic) will need to look\nat a minimum of N/2 names. Quantum mechanical systems can be in a superposition\nof states and simultaneously examine multiple names. By properly adjusting the\nphases of various operations, successful computations reinforce each other\nwhile others interfere randomly. As a result, the desired phone number can be\nobtained in only O(sqrt(N)) steps. The algorithm is within a small constant\nfactor of the fastest possible quantum mechanical algorithm.", "url": "http://arxiv.org/abs/quant-ph/9605043v3"}, {"reference": "Variational quantum algorithms", "title": "Variational Quantum Algorithms", "abstract": "Applications such as simulating complicated quantum systems or solving\nlarge-scale linear algebra problems are very challenging for classical\ncomputers due to the extremely high computational cost. Quantum computers\npromise a solution, although fault-tolerant quantum computers will likely not\nbe available in the near future. Current quantum devices have serious\nconstraints, including limited numbers of qubits and noise processes that limit\ncircuit depth. Variational Quantum Algorithms (VQAs), which use a classical\noptimizer to train a parametrized quantum circuit, have emerged as a leading\nstrategy to address these constraints. VQAs have now been proposed for\nessentially all applications that researchers have envisioned for quantum\ncomputers, and they appear to the best hope for obtaining quantum advantage.\nNevertheless, challenges remain including the trainability, accuracy, and\nefficiency of VQAs. Here we overview the field of VQAs, discuss strategies to\novercome their challenges, and highlight the exciting prospects for using them\nto obtain quantum advantage.", "url": "http://arxiv.org/abs/2012.09265v2"}, {"reference": "Quantum error correction for quantum memories", "title": "Quantum Error Correction for Quantum Memories", "abstract": "Active quantum error correction using qubit stabilizer codes has emerged as a\npromising, but experimentally challenging, engineering program for building a\nuniversal quantum computer. In this review we consider the formalism of qubit\nstabilizer and subsystem stabilizer codes and their possible use in protecting\nquantum information in a quantum memory. We review the theory of\nfault-tolerance and quantum error-correction, discuss examples of various codes\nand code constructions, the general quantum error correction conditions, the\nnoise threshold, the special role played by Clifford gates and the route\ntowards fault-tolerant universal quantum computation. The second part of the\nreview is focused on providing an overview of quantum error correction using\ntwo-dimensional (topological) codes, in particular the surface code\narchitecture. We discuss the complexity of decoding and the notion of passive\nor self-correcting quantum memories. The review does not focus on a particular\ntechnology but discusses topics that will be relevant for various quantum\ntechnologies.", "url": "http://arxiv.org/abs/1302.3428v7"}, {"reference": "Optimal local implementation of nonlocal quantum gates", "title": "Optimal local implementation of non-local quantum gates", "abstract": "We investigate the minimal resources that are required in the local\nimplementation of non-local quantum gates in a distributed quantum computer.\nBoth classical communication requirements and entanglement consumption are\ninvestigated. We present general statements on the minimal resource\nrequirements and present optimal procedures for a number of important gates,\nincluding CNOT and Toffoli gates. We show that one bit of classical\ncommunication in each direction is both necessary and sufficient for the\nnon-local implementation of the quantum CNOT, while in general two bits in each\ndirection is required for the implementation of a general two bit quantum gate.\nIn particular, the state-swapper requires this maximum classical communication\noverhead. Extensions of these ideas to multi-party gates are presented.", "url": "http://arxiv.org/abs/quant-ph/0005101v2"}, {"reference": "Distributed Quantum Computing and Network Control for Accelerated VQE", "title": "Distributed Quantum Computing and Network Control for Accelerated VQE", "abstract": "Interconnecting small quantum computers will be essential in the future for\ncreating large scale, robust quantum computers. Methods for distributing\nmonolithic quantum algorithms efficiently are thus needed. In this work we\nconsider an approach for distributing the accelerated variational quantum\neigensolver (AVQE) algorithm over arbitrary sized - in terms of number of\nqubits - distributed quantum computers. We consider approaches for distributing\nqubit assignments of the Ansatz states required to estimate the expectation\nvalue of Hamiltonian operators in quantum chemistry in a parallelized\ncomputation and provide a systematic approach to generate distributed quantum\ncircuits for distributed quantum computing. Moreover, we propose an\narchitecture for a distributed quantum control system in the settings of\ncentralized and decentralized network control.", "url": "http://arxiv.org/abs/2101.02504v1"}, {"reference": "Generalized GHZ states and distributed quantum computing", "title": "Generalized GHZ States and Distributed Quantum Computing", "abstract": "A key problem in quantum computing is finding a viable technological path\ntoward the creation of a scalable quantum computer. One possible approach\ntoward solving part of this problem is distributed computing, which provides an\neffective way of utilizing a network of limited capacity quantum computers.\n  In this paper, we present two primitive operations, cat-entangler and\ncat-disentangler, which in turn can be used to implement non-local operations,\ne.g. non-local CNOT and quantum teleportation. We also show how to establish an\nentangled pair, and use entangled pairs to efficiently create a generalized GHZ\nstate. Furthermore, we present procedures which allow us to reuse channel\nqubits in a sequence of non-local operations.\n  These non-local operations work on the principle that a cat-like state,\ncreated by cat-entangler, can be used to distribute a control qubit among\nmultiple computers. Using this principle, we show how to efficiently implement\nnon-local control operations in many situation, including a parallel\nimplementation of a certain kind of unitary transformation. Finally, as an\nexample, we present a distributed version of the quantum Fourier transform.", "url": "http://arxiv.org/abs/quant-ph/0402148v3"}, {"reference": "Distributed quantum machine learning", "title": "Distributed Quantum Machine Learning", "abstract": "Quantum computers can solve specific complex tasks for which no\nreasonable-time classical algorithm is known. Quantum computers do however also\noffer inherent security of data, as measurements destroy quantum states. Using\nshared entangled states, multiple parties can collaborate and securely compute\nquantum algorithms. In this paper we propose an approach for distributed\nquantum machine learning, which allows multiple parties to securely perform\ncomputations, without having to reveal their data. We will consider a\ndistributed adder and a distributed distance-based classifier.", "url": "http://arxiv.org/abs/2208.10316v1"}, {"reference": "Resource allocation in quantum networks for distributed quantum computing", "title": "Resource Allocation in Quantum Networks for Distributed Quantum Computing", "abstract": "The evolution of quantum computing technologies has been advancing at a\nsteady pace in the recent years, and the current trend suggests that it will\nbecome available at scale for commercial purposes in the near future. The\nacceleration can be boosted by pooling compute infrastructures to either\nparallelize algorithm execution or solve bigger instances that are not feasible\non a single quantum computer, which requires an underlying Quantum Internet:\nthe interconnection of quantum computers by quantum links and repeaters to\nexchange entangled quantum bits. However, Quantum Internet research so far has\nbeen focused on provisioning point-to-point flows only, which is suitable for\n(e.g.) quantum sensing and metrology, but not for distributed quantum\ncomputing. In this paper, after a primer on quantum computing and networking,\nwe investigate the requirements and objectives of smart computing on\ndistributed nodes from the perspective of quantum network provisioning. We then\ndesign a resource allocation strategy that is evaluated through a comprehensive\nsimulation campaign, whose results highlight the key features and performance\nissues, and lead the way to further investigation in this direction.", "url": "http://arxiv.org/abs/2203.05844v2"}, {"reference": "Distributed quantum computation over noisy channels", "title": "Distributed Quantum Computation over Noisy Channels", "abstract": "We analyse the use of entangled states to perform quantum computations non\nlocally among distant nodes in a quantum network. The complexity associated\nwith the generation of multiparticle entangled states is quantified in terms of\nthe concept of global cost. This parameter allows us to compare the use of\nphysical resources in different schemes. We show that for ideal channels and\nfor a sufficiently large number of nodes, the use of maximally entangled states\nis advantageous over uncorrelated ones. For noisy channels, one has to use\nentanglement purification procedures in order to create entangled states of\nhigh fidelity. We show that under certain circumstances a quantum network\nsupplied with a maximally entangled input still yields a smaller global cost,\nprovided that $n$ belongs to a given interval $n\\in [n_{min},n_{max}]$. The\nvalues of $n_{min}$ and $n_{max}$ crucially depend on the purification\nprotocols used to establish the $n$-- processor entangled states, as well as on\nthe presence of decoherence processes during the computation. The phase\nestimation problem has been used to illustrate this fact.", "url": "http://arxiv.org/abs/quant-ph/9803017v2"}, {"reference": "Efficient distributed quantum computing", "title": "Efficient Distributed Quantum Computing", "abstract": "We provide algorithms for efficiently addressing quantum memory in parallel.\nThese imply that the standard circuit model can be simulated with low overhead\nby the more realistic model of a distributed quantum computer. As a result, the\ncircuit model can be used by algorithm designers without worrying whether the\nunderlying architecture supports the connectivity of the circuit. In addition,\nwe apply our results to existing memory intensive quantum algorithms. We\npresent a parallel quantum search algorithm and improve the time-space\ntrade-off for the Element Distinctness and Collision problems.", "url": "http://arxiv.org/abs/1207.2307v2"}, {"reference": "Efficient implementation of quantum circuits with limited qubit interactions", "title": "Efficient implementation of Quantum circuits with limited qubit interactions", "abstract": "The quantum circuit model allows gates between any pair of qubits yet\nphysical instantiations allow only limited interactions. We address this\nproblem by providing an interaction graph together with an efficient method for\ncompiling quantum circuits so that gates are applied only locally. The graph\nrequires each qubit to interact with 4 other qubits and yet the time-overhead\nfor implementing any n-qubit quantum circuit is 6 log n. Building a network of\nquantum computing nodes according to this graph enables the network to emulate\na single monolithic device with minimal overhead.", "url": "http://arxiv.org/abs/1507.04263v2"}, {"reference": "Quantum Network Utility Maximization", "title": "Quantum Network Utility Maximization", "abstract": "Network Utility Maximization (NUM) is a mathematical framework that has\nendowed researchers with powerful methods for designing and analyzing classical\ncommunication protocols. NUM has also enabled the development of distributed\nalgorithms for solving the resource allocation problem, while at the same time\nproviding certain guarantees, e.g., that of fair treatment, to the users of a\nnetwork. We extend here the notion of NUM to quantum networks, and propose\nthree quantum utility functions -- each incorporating a different entanglement\nmeasure. We aim both to gain an understanding of some of the ways in which\nquantum users may perceive utility, as well as to explore structured and\ntheoretically-motivated methods of simultaneously servicing multiple users in\ndistributed quantum systems. Using our quantum NUM constructions, we develop an\noptimization framework for networks that use the single-photon scheme for\nentanglement generation, which enables us to solve the resource allocation\nproblem while exploring rate-fidelity tradeoffs within the network topologies\nthat we consider. We learn that two of our utility functions, which are based\non distillable entanglement and secret key fraction, are in close agreement\nwith each other and produce similar solutions to the optimization problems we\nstudy. Our third utility, based on entanglement negativity, has more favorable\nmathematical properties, and tends to place a higher value on the rate at which\nusers receive entangled resources, compared to the two previous utilities,\nwhich put a higher emphasis on end-to-end fidelity. These contrasting behaviors\nthus provide ideas regarding the suitability of quantum network utility\ndefinitions to different quantum applications.", "url": "http://arxiv.org/abs/2210.08135v1"}, {"reference": "Quantum Network Utility A Framework for Benchmarking Quantum Networks", "title": "Quantum Network Utility: A Framework for Benchmarking Quantum Networks", "abstract": "The absence of a common framework for benchmarking quantum networks is an\nobstacle to comparing the capabilities of different quantum networks. We\npropose a general framework for quantifying the performance of a quantum\nnetwork, which is based on the value created by connecting users through\nquantum channels. In this framework, we define the quantum network utility\nmetric $U_{QN}$ to capture the social and economic value of quantum networks.\nWhile the quantum network utility captures a variety of applications from\nsecure communications to distributed sensing, we study the example of\ndistributed quantum computing in detail. We hope that the adoption of the\nutility-based framework will serve as a foundation for guiding and assessing\nthe development of new quantum network technologies and designs.", "url": "http://arxiv.org/abs/2210.10752v1"}, {"reference": "Quantum internet protocol stack a comprehensive survey", "title": "Quantum Internet Protocol Stack: a Comprehensive Survey", "abstract": "Classical Internet evolved exceptionally during the last five decades, from a\nnetwork comprising a few static nodes in the early days to a leviathan\ninterconnecting billions of devices. This has been possible by the separation\nof concern principle, for which the network functionalities are organized as a\nstack of layers, each providing some communication functionalities through\nspecific network protocols. In this survey, we aim at highlighting the\nimpossibility of adapting the classical Internet protocol stack to the Quantum\nInternet, due to the marvels of quantum mechanics. Indeed, the design of the\nQuantum Internet requires a major paradigm shift of the whole protocol stack\nfor harnessing the peculiarities of quantum entanglement and quantum\ninformation. In this context, we first overview the relevant literature about\nQuantum Internet protocol stack. Then, stemming from this, we sheds the light\non the open problems and required efforts toward the design of an effective and\ncomplete Quantum Internet protocol stack. To the best of authors' knowledge, a\nsurvey of this type is the first of its own. What emerges from this analysis is\nthat the Quantum Internet, though still in its infancy, is a disruptive\ntechnology whose design requires an inter-disciplinary effort at the border\nbetween quantum physics, computer and telecommunications engineering.", "url": "http://arxiv.org/abs/2202.10894v2"}, {"reference": "Authenticated teleportation and verification in a noisy network", "title": "Authenticated teleportation and verification in a noisy network", "abstract": "Authenticated teleportation aims to certify the transmission of a quantum\nstate through teleportation, even in the presence of an adversary. This\nscenario can be pictured in terms of an untrusted source distributing a Bell\nstate between two parties who wish to verify it using some simple tests. We\npropose a protocol that achieves this goal in a practical way, and analyse its\nperformance and security when the parties have noisy measurement devices.\nFurther, we model a realistic experimental scenario where the state is subject\nto noise and dephasing. We finally apply our analysis to the verification of\ngraph states with noisy measurement devices.", "url": "http://arxiv.org/abs/1911.07000v2"}, {"reference": "Purification of noisy entanglement and faithful teleportation via noisy channels", "title": "Purification of Noisy Entanglement and Faithful Teleportation via Noisy Channels", "abstract": "Two separated observers, by applying local operations to a supply of\nnot-too-impure entangled states ({\\em e.g.} singlets shared through a noisy\nchannel), can prepare a smaller number of entangled pairs of arbitrarily high\npurity ({\\em e.g.} near-perfect singlets). These can then be used to faithfully\nteleport unknown quantum states from one observer to the other, thereby\nachieving faithful transfrom one observer to the other, thereby achieving\nfaithful transmission of quantum information through a noisy channel. We give\nupper and lower bounds on the yield $D(M)$ of pure singlets ($\\ket{\\Psi^-}$)\ndistillable from mixed states $M$, showing $D(M)>0$ if\n$\\bra{\\Psi^-}M\\ket{\\Psi^-}>\\half$.", "url": "http://arxiv.org/abs/quant-ph/9511027v2"}, {"reference": "Entanglement purification and quantum error correction", "title": "Entanglement purification and quantum error correction", "abstract": "We give a review on entanglement purification for bipartite and multipartite\nquantum states, with the main focus on theoretical work carried out by our\ngroup in the last couple of years. We discuss entanglement purification in the\ncontext of quantum communication, where we emphasize its close relation to\nquantum error correction. Various bipartite and multipartite entanglement\npurification protocols are discussed, and their performance under idealized and\nrealistic conditions is studied. Several applications of entanglement\npurification in quantum communication and computation are presented, which\nhighlights the fact that entanglement purification is a fundamental tool in\nquantum information processing.", "url": "http://arxiv.org/abs/0705.4165v2"}, {"reference": "Optimizing practical entanglement distillation", "title": "Optimizing practical entanglement distillation", "abstract": "The goal of entanglement distillation is to turn a large number of weakly\nentangled states into a smaller number of highly entangled ones. Practical\nentanglement distillation schemes offer a tradeoff between the fidelity to the\ntarget state, and the probability of successful distillation. Exploiting such\ntradeoffs is of interest in the design of quantum repeater protocols. Here, we\npresent a number of methods to assess and optimize entanglement distillation\nschemes. We start by giving a numerical method to compute upper bounds on the\nmaximum achievable fidelity for a desired probability of success. We show that\nthis method performs well for many known examples by comparing it to well-known\ndistillation protocols. This allows us to show optimality for many well-known\ndistillation protocols for specific states of interest. As an example, we\nanalytically prove optimality of the distillation protocol utilized within the\nExtreme Photon Loss (EPL) entanglement generation scheme, even in the\nasymptotic limit. We proceed to present a numerical method that can improve an\nexisting distillation scheme for a given input state, and we present an example\nfor which this method finds an optimal distillation protocol. An implementation\nof our numerical methods is available as a Julia package.", "url": "http://arxiv.org/abs/1803.10111v2"}, {"reference": "Topological and Subsystem Codes on Low-Degree Graphs with Flag Qubits", "title": "Topological and subsystem codes on low-degree graphs with flag qubits", "abstract": "In this work we introduce two code families, which we call the heavy hexagon\ncode and heavy square code. Both code families are implemented by assigning\nphysical data and ancilla qubits to both vertices and edges of low degree\ngraphs. Such a layout is particularly suitable for superconducting qubit\narchitectures to minimize frequency collisions and crosstalk. In some cases,\nfrequency collisions can be reduced by several orders of magnitude. The heavy\nhexagon code is a hybrid surface/Bacon-Shor code mapped onto a (heavy)\nhexagonal lattice whereas the heavy square code is the surface code mapped onto\na (heavy) square lattice. In both cases, the lattice includes all the ancilla\nqubits required for fault-tolerant error-correction. Naively, the limited qubit\nconnectivity might be thought to limit the error-correcting capability of the\ncode to less than its full distance. Therefore, essential to our construction\nis the use of flag qubits. We modify minimum weight perfect matching decoding\nto efficiently and scalably incorporate information from measurements of the\nflag qubits and correct up to the full code distance while respecting the\nlimited connectivity. Simulations show that high threshold values for both\ncodes can be obtained using our decoding protocol. Further, our decoding scheme\ncan be adapted to other topological code families.", "url": "http://arxiv.org/abs/1907.09528v2"}, {"reference": "Automated distribution of quantum circuits via hypergraph partitioning", "title": "Automated distribution of quantum circuits via hypergraph partitioning", "abstract": "Quantum algorithms are usually described as monolithic circuits, becoming\nlarge at modest input size. Near-term quantum architectures can only manage a\nsmall number of qubits. We develop an automated method to distribute quantum\ncircuits over multiple agents, minimising quantum communication between them.\nWe reduce the problem to hypergraph partitioning and then solve it with\nstate-of-the-art optimisers. This makes our approach useful in practice, unlike\nprevious methods. Our implementation is evaluated on five quantum circuits of\npractical relevance.", "url": "http://arxiv.org/abs/1811.10972v5"}, {"reference": "Distribution of Quantum Circuits Over General Quantum Networks", "title": "Distribution of Quantum Circuits Over General Quantum Networks", "abstract": "Near-term quantum computers can hold only a small number of qubits. One way\nto facilitate large-scale quantum computations is through a distributed network\nof quantum computers. In this work, we consider the problem of distributing\nquantum programs represented as quantum circuits across a quantum network of\nheterogeneous quantum computers, in a way that minimizes the overall\ncommunication cost required to execute the distributed circuit. We consider two\nways of communicating: cat-entanglement that creates linked copies of qubits\nacross pairs of computers, and teleportation. The heterogeneous computers\nimpose constraints on cat-entanglement and teleportation operations that can be\nchosen by an algorithm. We first focus on a special case that only allows\ncat-entanglements and not teleportations for communication. We provide a\ntwo-step heuristic for solving this specialized setting: (i) finding an\nassignment of qubits to computers using Tabu search, and (ii) using an\niterative greedy algorithm designed for a constrained version of the set cover\nproblem to determine cat-entanglement operations required to execute gates\nlocally.\n  For the general case, which allows both forms of communication, we propose\ntwo algorithms that subdivide the quantum circuit into several portions and\napply the heuristic for the specialized setting on each portion. Teleportations\nare then used to stitch together the solutions for each portion. Finally, we\nsimulate our algorithms on a wide range of randomly generated quantum networks\nand circuits, and study the properties of their results with respect to several\nvarying parameters.", "url": "http://arxiv.org/abs/2206.06437v1"}, {"reference": "Optimized quantum circuit partitioning", "title": "Optimized Quantum Circuit Partitioning", "abstract": "The main objective of this paper is to improve the communication costs in\ndistributed quantum circuits. To this end, we present a method for generating\ndistributed quantum circuits from monolithic quantum circuits in such a way\nthat communication between partitions of a distributed quantum circuit is\nminimized. Thus, the communication between distributed components is performed\nat a lower cost. Compared to existing works, our approach can effectively map a\nquantum circuit into an appropriate number of distributed components. Since\nteleportation is usually the protocol used to connect components in a\ndistributed quantum circuit, our approach ultimately reduces the number of\nteleportations. The results of applying our approach to the benchmark quantum\ncircuits determine its effectiveness and show that partitioning is a necessary\nstep in constructing distributed quantum circuit.", "url": "http://arxiv.org/abs/2005.11614v1"}, {"reference": "A dynamic programming approach for distributing quantum circuits by bipartite graphs", "title": "A dynamic programming approach for distributing quantum circuits by bipartite graphs", "abstract": "Near-term large quantum computers are not able to operate as a single\nprocessing unit. It is therefore required to partition a quantum circuit into\nsmaller parts, and then each part is executed on a small unit. This approach is\nknown as distributed quantum computation. In this study, a dynamic programming\nalgorithm is proposed to minimize the number of communications in a distributed\nquantum circuit (DQC). This algorithm consists of two steps: first, the quantum\ncircuit is converted into a bipartite graph model, and then a dynamic\nprogramming approach (DP) is proposed to partition the model into low-capacity\nquantum circuits. The proposed approach is evaluated on some benchmark quantum\ncircuits with remarkable reduction in the number of required teleportations.", "url": "http://arxiv.org/abs/2005.01052v1"}, {"reference": "Optimized compiler for distributed quantum computing 2021", "title": "Optimized compiler for Distributed Quantum Computing", "abstract": "Practical distributed quantum computing requires the development of efficient\ncompilers, able to make quantum circuits compatible with some given hardware\nconstraints. This problem is known to be tough, even for local computing. Here,\nwe address it on distributed architectures. As generally assumed in this\nscenario, telegates represent the fundamental remote (inter-processor)\noperations. Each telegate consists of several tasks: i) entanglement generation\nand distribution, ii) local operations, and iii) classical communications.\nEntanglement generations and distribution is an expensive resource, as it is\ntime-consuming and fault-prone. To mitigate its impact, we model an\noptimization problem that combines running-time minimization with the usage of\nthat resource. Specifically, we provide a parametric ILP formulation, where the\nparameter denotes a time horizon (or time availability); the objective function\ncount the number of used resources. To minimize the time, a binary search\nsolves the subject ILP by iterating over the parameter. Ultimately, to enhance\nthe solution space, we extend the formulation, by introducing a predicate that\nmanipulates the circuit given in input and parallelizes telegates' tasks.", "url": "http://arxiv.org/abs/2112.14139v1"}, {"reference": "Implementation of Shors algorithm on a linear nearest neighbor qubit array", "title": "Implementation of Shor's Algorithm on a Linear Nearest Neighbour Qubit Array", "abstract": "Shor's algorithm, which given appropriate hardware can factorise an integer\n$N$ in a time polynomial in its binary length $L$, has arguable spurred the\nrace to build a practical quantum computer. Several different quantum circuits\nimplementing Shor's algorithm have been designed, but each tacitly assumes that\narbitrary pairs of qubits within the computer can be interacted. While some\nquantum computer architectures possess this property, many promising proposals\nare best suited to realising a single line of qubits with nearest neighbour\ninteractions only. In light of this, we present a circuit implementing Shor's\nfactorisation algorithm designed for such a linear nearest neighbour\narchitecture. Despite the interaction restrictions, the circuit requires just\n$2L+4$ qubits and to first order requires $8L^{4}$ gates arranged in a circuit\nof depth $32L^{3}$ -- identical to first order to that possible using an\narchitecture that can interact arbitrary pairs of qubits.", "url": "http://arxiv.org/abs/quant-ph/0402196v1"}, {"reference": "Noise-adaptive compiler mappings for noisy intermediatescale quantum computers", "title": "Noise-Adaptive Compiler Mappings for Noisy Intermediate-Scale Quantum Computers", "abstract": "A massive gap exists between current quantum computing (QC) prototypes, and\nthe size and scale required for many proposed QC algorithms. Current QC\nimplementations are prone to noise and variability which affect their\nreliability, and yet with less than 80 quantum bits (qubits) total, they are\ntoo resource-constrained to implement error correction. The term Noisy\nIntermediate-Scale Quantum (NISQ) refers to these current and near-term systems\nof 1000 qubits or less. Given NISQ's severe resource constraints, low\nreliability, and high variability in physical characteristics such as coherence\ntime or error rates, it is of pressing importance to map computations onto them\nin ways that use resources efficiently and maximize the likelihood of\nsuccessful runs.\n  This paper proposes and evaluates backend compiler approaches to map and\noptimize high-level QC programs to execute with high reliability on NISQ\nsystems with diverse hardware characteristics. Our techniques all start from an\nLLVM intermediate representation of the quantum program (such as would be\ngenerated from high-level QC languages like Scaffold) and generate QC\nexecutables runnable on the IBM Q public QC machine. We then use this framework\nto implement and evaluate several optimal and heuristic mapping methods. These\nmethods vary in how they account for the availability of dynamic machine\ncalibration data, the relative importance of various noise parameters, the\ndifferent possible routing strategies, and the relative importance of\ncompile-time scalability versus runtime success. Using real-system\nmeasurements, we show that fine grained spatial and temporal variations in\nhardware parameters can be exploited to obtain an average $2.9$x (and up to\n$18$x) improvement in program success rate over the industry standard IBM\nQiskit compiler.", "url": "http://arxiv.org/abs/1901.11054v1"}, {"reference": "Extracting success from ibms 20-qubit machines using error-aware compilation", "title": "Extracting Success from IBM's 20-Qubit Machines Using Error-Aware Compilation", "abstract": "NISQ (Noisy, Intermediate-Scale Quantum) computing requires error mitigation\nto achieve meaningful computation. Our compilation tool development focuses on\nthe fact that the error rates of individual qubits are not equal, with a goal\nof maximizing the success probability of real-world subroutines such as an\nadder circuit. We begin by establishing a metric for choosing among possible\npaths and circuit alternatives for executing gates between variables placed far\napart within the processor, and test our approach on two IBM 20-qubit systems\nnamed Tokyo and Poughkeepsie. We find that a single-number metric describing\nthe fidelity of individual gates is a useful but imperfect guide. Our compiler\nuses this subsystem and maps complete circuits onto the machine using a beam\nsearch-based heuristic that will scale as processor and program sizes grow. To\nevaluate the whole compilation process, we compiled and executed adder\ncircuits, then calculated the KL-divergence (a measure of the distance between\ntwo probability distributions). For a circuit within the capabilities of the\nhardware, our compilation increases estimated success probability and reduces\nKL-divergence relative to an error-oblivious placement.", "url": "http://arxiv.org/abs/1903.10963v1"}, {"reference": "A hardware-aware heuristic for the qubit mapping problem in the nisq era", "title": "A Hardware-Aware Heuristic for the Qubit Mapping Problem in the NISQ Era", "abstract": "Due to several physical limitations in the realisation of quantum hardware,\ntoday's quantum computers are qualified as Noisy Intermediate-Scale Quantum\n(NISQ) hardware. NISQ hardware is characterized by a small number of qubits (50\nto a few hundred) and noisy operations. Moreover, current realisations of\nsuperconducting quantum chips do not have the ideal all-to-all connectivity\nbetween qubits but rather at most a nearest-neighbour connectivity. All these\nhardware restrictions add supplementary low-level requirements. They need to be\naddressed before submitting the quantum circuit to an actual chip. Satisfying\nthese requirements is a tedious task for the programmer. Instead, the task of\nadapting the quantum circuit to a given hardware is left to the compiler. In\nthis paper, we propose a Hardware-Aware mapping transition algorithm (HA) that\ntakes the calibration data into account with the aim to improve the overall\nfidelity of the circuit. Evaluation results on IBM quantum hardware show that\nour HA approach can outperform the state of the art both in terms of the number\nof additional gates and circuit fidelity.", "url": "http://arxiv.org/abs/2010.03397v1"}, {"reference": "Noise-adaptive quantum compilation strategies evaluated with applicationmotivated benchmarks", "title": "Noise-Adaptive Quantum Compilation Strategies Evaluated with Application-Motivated Benchmarks", "abstract": "Quantum compilation is the problem of translating an input quantum circuit\ninto the most efficient equivalent of itself, taking into account the\ncharacteristics of the device that will execute the computation. Compilation\nstrategies are composed of sequential passes that perform placement, routing\nand optimization tasks. Noise-adaptive compilers do take the noise statistics\nof the device into account, for some or all passes. The noise statics can be\nobtained from calibration data, and updated after each device calibration. In\nthis paper, we propose a novel noise-adaptive compilation strategy that is\ncomputationally efficient. The proposed strategy assumes that the quantum\ndevice coupling map uses a heavy-hexagon lattice. Moreover, we present the\napplication-motivated benchmarking of the proposed noise-adaptive compilation\nstrategy, compared with some of the most advanced state-of-art approaches. The\npresented results seem to indicate that our compilation strategy is\nparticularly effective for deep circuits and for square circuits.", "url": "http://arxiv.org/abs/2108.11874v1"}, {"reference": "A distributed simulation framework for quantum networks and channels", "title": "A distributed simulation framework for quantum networks and channels", "abstract": "We introduce the Simulator for Quantum Networks and Channels\n($\\texttt{SQUANCH}$), an open-source Python library for creating parallelized\nsimulations of distributed quantum information processing. The framework\nincludes many features of a general-purpose quantum computing simulator, but it\nis optimized specifically for simulating quantum networks. It includes\nfunctionality to allow users to easily design complex multi-party quantum\nnetworks, extensible classes for modeling noisy quantum channels, and a\nmultiprocessed NumPy backend for performant simulations. We present an overview\nof the structure of the library, describing how the various API elements\nrepresent the underlying physics and providing simple usage examples for each\nmodule. Finally, we present several demonstrations of canonical quantum\ninformation protocols implemented using this framework.", "url": "http://arxiv.org/abs/1808.07047v1"}, {"reference": "NetSquid a NETwork Simulator for QUantum Information using Discrete events", "title": "NetSquid, a NETwork Simulator for QUantum Information using Discrete events", "abstract": "In order to bring quantum networks into the real world, we would like to\ndetermine the requirements of quantum network protocols including the\nunderlying quantum hardware. Because detailed architecture proposals are\ngenerally too complex for mathematical analysis, it is natural to employ\nnumerical simulation. Here we introduce NetSquid, the NETwork Simulator for\nQUantum Information using Discrete events, a discrete-event based platform for\nsimulating all aspects of quantum networks and modular quantum computing\nsystems, ranging from the physical layer and its control plane up to the\napplication level. We study several use cases to showcase NetSquid's power,\nincluding detailed physical layer simulations of repeater chains based on\nnitrogen vacancy centres in diamond as well as atomic ensembles. We also study\nthe control plane of a quantum switch beyond its analytically known regime, and\nshowcase NetSquid's ability to investigate large networks by simulating\nentanglement distribution over a chain of up to one thousand nodes.", "url": "http://arxiv.org/abs/2010.12535v3"}, {"reference": "Sequence a customizable discrete-event simulator of quantum networks", "title": "SeQUeNCe: A Customizable Discrete-Event Simulator of Quantum Networks", "abstract": "Recent advances in quantum information science enabled the development of\nquantum communication network prototypes and created an opportunity to study\nfull-stack quantum network architectures. This work develops SeQUeNCe, a\ncomprehensive, customizable quantum network simulator. Our simulator consists\nof five modules: Hardware models, Entanglement Management protocols, Resource\nManagement, Network Management, and Application. This framework is suitable for\nsimulation of quantum network prototypes that capture the breadth of current\nand future hardware technologies and protocols. We implement a comprehensive\nsuite of network protocols and demonstrate the use of SeQUeNCe by simulating a\nphotonic quantum network with nine routers equipped with quantum memories. The\nsimulation capabilities are illustrated in three use cases. We show the\ndependence of quantum network throughput on several key hardware parameters and\nstudy the impact of classical control message latency. We also investigate\nquantum memory usage efficiency in routers and demonstrate that redistributing\nmemory according to anticipated load increases network capacity by 69.1% and\nthroughput by 6.8%. We design SeQUeNCe to enable comparisons of alternative\nquantum network technologies, experiment planning, and validation and to aid\nwith new protocol design. We are releasing SeQUeNCe as an open source tool and\naim to generate community interest in extending it.", "url": "http://arxiv.org/abs/2009.12000v1"}, {"reference": "QuNetSim A Software Framework for Quantum Networks", "title": "QuNetSim: A Software Framework for Quantum Networks", "abstract": "As quantum internet technologies develop, the need for simulation software\nand education for quantum internet rises. QuNetSim aims to fill this need.\nQuNetSim is a Python software framework that can be used to simulate quantum\nnetworks up to the network layer. The goal of QuNetSim is to make it easier to\ninvestigate and test quantum networking protocols over various quantum network\nconfigurations and parameters. The framework incorporates many known quantum\nnetwork protocols so that users can quickly build simulations and beginners can\neasily learn to implement their own quantum networking protocols.", "url": "http://arxiv.org/abs/2003.06397v5"}, {"reference": "Benchmarking of quantum protocols", "title": "Benchmarking of Quantum Protocols", "abstract": "Quantum network protocols offer new functionalities such as enhanced security\nto communication and computational systems. Despite the rapid progress in\nquantum hardware, it has not yet reached a level of maturity that enables\nexecution of many quantum protocols in practical settings. To develop quantum\nprotocols in real world, it is necessary to examine their performance\nconsidering the imperfections in their practical implementation using\nsimulation platforms. In this paper, we consider several quantum protocols that\nenable promising functionalities and services in near-future quantum networks.\nThe protocols are chosen from both areas of quantum communication and quantum\ncomputation as follows: quantum money, W-state based anonymous transmission,\nverifiable blind quantum computation, and quantum digital signature. We use\nNetSquid simulation platform to evaluate the effect of various sources of noise\non the performance of these protocols, considering different figures of merit.\nWe find that to enable quantum money protocol, the decoherence time constant of\nthe quantum memory must be at least three times the storage time of qubits.\nFurthermore, our simulation results for the w-state based anonymous\ntransmission protocol show that to achieve an average fidelity above 0.8 in\nthis protocol, the storage time of sender's and receiver's particles in the\nquantum memory must be less than half of the decoherence time constant of the\nquantum memory. We have also investigated the effect of gate imperfections on\nthe performance of verifiable blind quantum computation. We find that with our\nchosen parameters, if the depolarizing probability of quantum gates is equal to\nor greater than 0.05, the security of the protocol cannot be guaranteed.\nLastly, our simulation results for quantum digital signature protocol show that\nchannel loss has a significant effect on the probability of repudiation.", "url": "http://arxiv.org/abs/2111.02527v2"}, {"reference": "Quantum error correction for beginners", "title": "Quantum Error Correction for Beginners", "abstract": "Quantum error correction (QEC) and fault-tolerant quantum computation\nrepresent one of the most vital theoretical aspect of quantum information\nprocessing. It was well known from the early developments of this exciting\nfield that the fragility of coherent quantum systems would be a catastrophic\nobstacle to the development of large scale quantum computers. The introduction\nof quantum error correction in 1995 showed that active techniques could be\nemployed to mitigate this fatal problem. However, quantum error correction and\nfault-tolerant computation is now a much larger field and many new codes,\ntechniques, and methodologies have been developed to implement error correction\nfor large scale quantum algorithms. In response, we have attempted to summarize\nthe basic aspects of quantum error correction and fault-tolerance, not as a\ndetailed guide, but rather as a basic introduction. This development in this\narea has been so pronounced that many in the field of quantum information,\nspecifically researchers who are new to quantum information or people focused\non the many other important issues in quantum computation, have found it\ndifficult to keep up with the general formalisms and methodologies employed in\nthis area. Rather than introducing these concepts from a rigorous mathematical\nand computer science framework, we instead examine error correction and\nfault-tolerance largely through detailed examples, which are more relevant to\nexperimentalists today and in the near future.", "url": "http://arxiv.org/abs/0905.2794v4"}, {"reference": "Open quantum assembly language", "title": "Open Quantum Assembly Language", "abstract": "This document describes a quantum assembly language (QASM) called OpenQASM\nthat is used to implement experiments with low depth quantum circuits. OpenQASM\nrepresents universal physical circuits over the CNOT plus SU(2) basis with\nstraight-line code that includes measurement, reset, fast feedback, and gate\nsubroutines. The simple text language can be written by hand or by higher level\ntools and may be executed on the IBM Q Experience.", "url": "http://arxiv.org/abs/1707.03429v2"}, {"reference": "Microwave quantum link between superconducting circuits housed in spatially separated cryogenic systems", "title": "Microwave Quantum Link between Superconducting Circuits Housed in Spatially Separated Cryogenic Systems", "abstract": "Superconducting circuits are a strong contender for realizing quantum\ncomputing systems, and are also successfully used to study quantum optics and\nhybrid quantum systems. However, their cryogenic operation temperatures and the\ncurrent lack of coherence-preserving microwave-to-optical conversion solutions\nhave hindered the realization of superconducting quantum networks either\nspanning different cryogenics systems or larger distances. Here, we report the\nsuccessful operation of a cryogenic waveguide coherently linking transmon\nqubits located in two dilution refrigerators separated by a physical distance\nof five meters. We transfer qubit states and generate entanglement on-demand\nwith average transfer and target state fidelities of 85.8 % and 79.5 %,\nrespectively, between the two nodes of this elementary network. Cryogenic\nmicrowave links do provide an opportunity to scale up systems for quantum\ncomputing and create local area quantum communication networks over length\nscales of at least tens of meters.", "url": "http://arxiv.org/abs/2008.01642v1"}]